{
  "backend/main.mo": "Empty Motoko actor with no functionality; backend serves no data storage or API endpoints.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: Contact section address, phone number, operating hours updates, and Hero background image replacement.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component structure, styling, and functionality of the Space Cafe website.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark modes with cosmic coffee shop theme colors.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Space Cafe Coffee Shop application.",
  "frontend/src/App.tsx": "Root React component that renders all page sections in sequence: Hero, About, Menu, Gallery, Reviews, Contact, and Footer.",
  "frontend/src/components/About.tsx": "About Us section displaying mission statement, promise card with heart icons, and three feature highlights (Handcrafted, Quality First, Community) with icons.",
  "frontend/src/components/Contact.tsx": "Contact section with Kuwait business details (Salhiya st address, +96566339592 phone), detailed weekly hours with special holiday notes, social media links, action buttons, parking info, and contact form.",
  "frontend/src/components/Footer.tsx": "Footer with newsletter subscription form, copyright notice, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Gallery.tsx": "Gallery section displaying seven cafe images in responsive grid with hover effects and modal dialogs for full-size viewing.",
  "frontend/src/components/Hero.tsx": "Hero section component with background image, headline with animated sparkles, tagline, description, and two CTA buttons (\"Visit Us Today\" and \"Order Online\") plus a decorative SVG wave at the bottom.",
  "frontend/src/components/Menu.tsx": "Menu highlights section displaying two card grids: one for coffee/drinks (5 items) and one for desserts/snacks (4 items), with icons, descriptions, and a call-out for seasonal options.",
  "frontend/src/components/Reviews.tsx": "Customer reviews section showing four 5-star testimonials in a card grid with a CTA button linking to Google reviews.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor using React Query, handling both authenticated and anonymous identities, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data storage functionality; all content is static and rendered directly in components.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom cosmic-themed color palette (browns, creams, golds, purples) defined using OKLCH color space for both light and dark modes, plus custom shadow utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom cosmic color palette, display font (Playfair Display), container settings, and animation keyframes for the coffee shop design system.",
  "project_state.json": "Project state file for Space Cafe Coffee Shop website tracking 10 implemented features including hero section, about us, menu highlights, gallery, reviews, contact form, and newsletter subscription. Contains architectural notes for responsive multi-section design with social media integration and map embed."
}